{
  "en": [
    {
      "post_date": "20 Sept, 2023",
      "post_title": "Critical update for website",
      "post_author": "NMVX",
      "post_para": {
        "para1": "Critical update for <em>'Home, Project'</em> and removed product page in future version.",
        "para2": "The 'Product' page have been removed from parents website. All connected linked have been update for footer and home pages. Updated new NPM and Nodejs version to latest stable versions, Webpack have been update and tested multiple times during development."
      }
    },
    {
      "post_date": "26 Mei, 2023",
      "post_title": "Website <em>renewal</em> and <em>overhaul</em>",
      "post_author": "NMVX",
      "post_para": {
        "para1": "User interface updates and overhauls for 'Homes, products, projects, and blog' pages.",
        "para2": "This update includes a 'Javascript' preprocessor for each modified page. For the entire project page the preview grid has been changed from flat to a 5x3 grid. For products, added a default page for product selection before being taken to the actual product page (the product page has been separated, each product has its own page and does not depend on script injection from Javascript). For blogs, modified from paragraph-based to canonical article-based."
      }
    },
    {
      "post_date": "9 Mei, 2023",
      "post_title": "<strong>The <em>'Revenant Formal'</em> project has entered the 'Alpha' phase!.</strong>",
      "post_author": "NMVX",
      "post_para": {
        "para1": "<em>Alpha phase</em> have been release to public, Included all new features (refer previous developer update).",
        "para2": "Included new <em>hashes</em> based assets, <em>subresources integrity</em> for CSS and javascripts for preventing XSS Attacks in website, DOMPurify and assets optimization tools."
      }
    },
    {
      "post_date": "4 Mei, 2023",
      "post_title": "<em>New feature</em> added 'Language changer - Malay'",
      "post_author": "NMVX",
      "post_para": {
        "para1": "New language modifications have been added for the <em>'Home, Project, Product, blog, and 404'</em> pages and also the internal system for the <em>network</em> has been improved.",
        "para2": "Much of the internal algorithm for network control has been reworked to stabilize the internal <em>'URL Hoop'</em> redirect firebase. All <em>user interfaces</em> for language selection have been shared. (may require some modifications and tests in the future)."
      }
    },
    {
      "post_date": "5 Mac, 2023",
      "post_title": "Modify 'page #1, #2 & #3'",
      "post_author": "NMVX",
      "post_para": {
        "para1": "Modify the website for <em>'Home, Project, Product'</em> and add new ones for '404' and 'Blog' pages.",
        "para2": "The 'Home' website has been modified from the <em>'Header' and 'Footer'</em> sections. The color preference and opacity have been changed from <em>'Opaque' to 'Transparent'</em> and rearranged from horizontal to stacked shapes. For 'Project' has been modified and optimized from <em>'CSS driven animation'</em> to <em>'Javascript + CSS driven animation'</em> to avoid low performance on <a class='link' href='https://web.dev/rendering-performance/' target='_blank'>website render </a> . For 'Product' is the same as 'Project'."
      }
    }
  ],
  "ms": [
    {
      "post_date": "20 Sept, 2023",
      "post_title": "Kemas kini kritikal untuk laman web",
      "post_author": "NMVX",
      "post_para": {
        "para1": "Kemas kini kritikal untuk <em>'Home, Project'</em> dan halaman produk yang dialih keluar dalam versi akan datang.",
        "para2": "Halaman 'Produk' telah dialih keluar daripada laman web utama. Semua pautan yang disambungkan telah dikemas kini untuk pengaki dan halaman utama. Mengemas kini versi NPM dan Nodejs baharu kepada versi stabil terkini, Webpack telah dikemas kini dan diuji beberapa kali semasa pembangunan."
      }
    },
    {
      "post_date": "26 Mei, 2023",
      "post_title": "<em>pembaharuan</em> dan <em>baik pulih</em> tapak web",
      "post_author": "NMVX",
      "post_para": {
        "para1": "Pembaharuan dan baik pulih antaramuka pengguna untuk halaman 'Rerumah, produk, projek, dan blog'.",
        "para2": "Pembaharuan ini termasuk prapemproses 'Javascript' untuk setiap halaman yang diubah suai. Untuk halaman projek keseluruhan grid pratonton telah diubah dari leper ke grid 5x3. Untuk product, ditambah halaman lalai untuk pilihan produk sebelum dibawa ke halaman sebenar produk(halaman produk telah diasingkan, setiap produk memiliki halaman tersendiri dan tidak bergantung pada suntikan skrip dari Javascript). Untuk blog diubah suai dari berasaskan perenggan kepada artikel berasaskan kanonik."
      }
    },
    {
      "post_date": "9 Mei, 2023",
      "post_title": "<strong>Projek <em>'Revenant Formal'</em> telah memasuki fasa 'Alpha'!.</strong>",
      "post_author": "NMVX",
      "post_para": {
        "para1": "<em>Fasa alfa</em> telah dikeluarkan kepada umum, Termasuk semua ciri baharu (rujuk kemas kini pembangun sebelumnya).",
        "para2": "Termasuk aset berasaskan <em>'Hashes'</em> baharu, <em>integriti subsumber</em> untuk CSS dan javascript untuk mencegah Serangan XSS dalam tapak web, DOMPurify dan alat pengoptimuman aset."
      }
    },
    {
      "post_date": "4 Mei, 2023",
      "post_title": "<em>Ciri baharu</em> ditambah 'Pengubah bahasa - Bahasa Melayu'",
      "post_author": "NMVX",
      "post_para": {
        "para1": "Pengubahsuaian bahasa baharu telah ditambah untuk halaman <em>'Home, Project, Product, blog, and 404'</em> dan juga sistem dalaman untuk <em>rangkaian(network)</em> telah diperbaik.",
        "para2": "Sebahagian besar algoritma dalaman untuk kawalan rangkaian telah dibuat semula untuk menstabilkan <em>'URL Hoop'</em> didalam ubah hala(Redirect) firebase. Semua <em>antaramuka pengguna</em> untuk pemilihan bahasa telah disekatakan. (kemungkinan memerlukan beberapa pengubahsuaian dan ujian di masa hadapan)."
      }
    },
    {
      "post_date": "5 Mac, 2023",
      "post_title": "Ubahsuai 'page #1, #2 & #3'",
      "post_author": "NMVX",
      "post_para": {
        "para1": "Ubahsuai laman sesawang untuk <em>'Home, Project, Product'</em> dan tambah baharu untuk laman '404' dan 'Blog'.",
        "para2": "Laman sesawang 'Home' telah diubahsuai dari bahagian <em>'Header' dan 'Footer'</em>. Keutamaan warna dan kelegapan telah diubah dari <em>'Opaque' kepada 'Transparent'</em> dan disusun semula dari mendatar kepada bentuk tersusun. Untuk 'Project' telah diubahsuai dan dioptimumkan dari <em>'CSS driven animation'</em> kepada <em>'Javascript + CSS driven animation'</em> bagi mengelakkan prestasi rendah pada <a class='link' href='https://web.dev/rendering-performance/' target='_blank'>kemas gabung laman sesawang</a> . Untuk 'Product' adalah sama seperti 'Project'."
      }
    }
  ]
}